/* 
  Localizable.strings
  MWeb

  Created by oulvhai on 15/12/12.
  Copyright © 2015年 Otis. All rights reserved.
*/

/* list panel right click menu */

"Open in New Window" = "Open in New Window";
"Move to Trash" = "Move to Trash";
"Put Back" = "Put Back";
"Delete" = "Delete";
"Export as PDF..." = "Export as PDF...";
"Export as HTML..." = "Export as HTML...";
"Export as Markdown..." = "Export as Markdown...";
"Show in Finder" = "Show in Finder";

/* category panel right click menu */
"Edit" = "Edit";
"New Category" = "New Category";
"New Sub Category" = "New Sub Category";
"New Document" = "New Document";
"Import Files To Library..." = "Import Files To Library...";
"Build Site" = "Build Site";
"Clear & Rebuild Site" = "Clear & Rebuild Site";
"Preview Site..." = "Preview Site...";
"Build & Preview Site..." = "Build & Preview Site...";
"Open Build Path in Finder..." = "Open Build Path in Finder...";

"Build Site Errors!" = "Build Site Errors!";
"OK" = "OK";
"Building..." = "Building...";
"Clear & Rebuilding..." = "Clear & Rebuilding...";

/* folder pane right click menu */
"New Folder" = "New Folder";
"Expand All" = "Expand All";
"Collapse All" = "Collapse All";
"Refresh" = "Refresh";
"Unable to add as external source." = "Unable to add as external source.";


/* external folder attribute */
"File Name DESC" = "File Name DESC";
"File Name ASC" = "File Name ASC";
"Create Date DESC" = "Create Date DESC";
"Create Date ASC" = "Create Date ASC";
"Modify Date DESC" = "Modify Date DESC";
"Modify Date ASC" = "Modify Date ASC";
"Same as Preferences" = "Same as Preferences";
"Enable Newlines to <br>" = "Enable Newlines to <br>";
"Disable Newlines to <br>" = "Disable Newlines to <br>";
"Relative" = "Relative";
"Absolute" = "Absolute";

/* titlebar setting pane */
"Extension for %@" = "Extension for %@";
"This HTML file name is existed!" = "This HTML file name is existed!";

/* pdf export accessory view controller */
"Create a Table of Contents for PDF (Pro Only)." = "Create a Table of Contents for PDF (Pro Only).";

/* publish service */
"Update published document ( published in %@ )" = "Update published document ( published in %@ )";

"Error:" = "Error:";
"Please fill Blog URL!" = "Please fill Blog URL!";
"Please fill Publish URL!" = "Please fill Publish URL!";
"Please fill Account!" = "Please fill Account!";
"Please fill Password!" = "Please fill Password!";
"Validation failed! Can't get the blog info!" = "Validation failed! Can't get the blog info!";

"faultCode:%@, faultMessage:%@." = "faultCode:%@, faultMessage:%@.";

/* publish tumblr */
"Please fill Tumblr Email!" = "Please fill Tumblr Email!";
"Post to Tumblr by Email" = "Post to Tumblr by Email";


/* evernote */
"Please fill Title!" = "Please fill Title!";

/* wordpress.com */
"Fetch Categories Error:" = "Fetch Categories Error:";
"Fetch Post Error:" = "Fetch Post Error:";

/* meduim */
"Please fill integration Token!" = "Please fill integration Token!";
"Please try again!" = "Please try again!";
"The integration Token is invalid or has been revoked." = "The integration Token is invalid or has been revoked.";
"You can get an integration Token at the bottom of the Settings page of your Medium account." = "You can get an integration Token at the bottom of the Settings page of your Medium account.";
"Settings page" = "Settings page";


/* local images upload */
"POST Header Data" = "POST Header Data";
"POST Body Data" = "POST Body Data";
"Please fill Name!" = "Please fill Name!";
"Please fill API URL!" = "Please fill API URL!";
"Please fill POST File Name!" = "Please fill POST File Name!";
"Please fill Response URL Path!" = "Please fill Response URL Path!";
"Validation" = "Validation";
"Success!" = "Success!";
"Uploaded Image URL is: %@" = "Uploaded Image URL is: %@";
"Can't get access token!" = "Can't get access token!";

/* extension */
"Please Fill Template Variables Name!" = "Please Fill Template Variables Name!";
"This Template Variables Name is used!" = "This Template Variables Name is used!";

/* preferences */
"Typewriter Scrolling Activate when Content’s height %ld%% of Editor" = "Typewriter Scrolling Activate when Content’s height %ld%% of Editor";
"Choose" = "Choose";
"General" = "General";

"Cancel" = "Cancel";
"Delete selected items?" = "Delete selected items?";
"Import" = "Import";
"Can't read the file!" = "Can't read the file!";
"Error: %@" = "Error: %@";
"Parse json error!" = "Parse json error!";
"Extension" = "Extension";

"Themes" = "Themes";
"Custom..." = "Custom...";

/* publish preferences */
"Delete the service?" = "Delete the service?";
"Deleted service cannot be restored." = "Deleted service cannot be restored.";
"Evernote service already added!" = "Evernote service already added!";
"印象笔记 service already added!" = "印象笔记 service already added!";
"%@ already added!" = "%@ already added!";
"Save Access Token Error:" = "Save Access Token Error:";
"Can't find any blog in Blogger!" = "Can't find any blog in Blogger!";
"Publishing" = "Publishing";

/* backup */
"Backup Location 1 is not exsit, removed!" = "Backup Location 1 is not exsit, removed! ";
"Backup Location 2 is not exsit, removed!" = "Backup Location 2 is not exsit, removed! ";
"Backup Location 3 is not exsit, removed!" = "Backup Location 3 is not exsit, removed! ";
"Last Backup: %@" = "Last Backup: %@";
"Last Backup: - " = "Last Backup: - ";
"Backup" = "Backup";

/* cfawindowcontroller */
"No document in this category!" = "No document in this category!";
"Generating PDF..." = "Generating PDF...";
"Export" = "Export";
"Export documents error !" = "Export documents error !";
"Insert" = "Insert";
"Copy HTML" = "Copy HTML";
"There were some errors when parsing the stylesheet:" = "There were some errors when parsing the stylesheet:";
"Copy as Image" = "Copy as Image";
"Save as Image..." = "Save as Image...";
"Save as PDF..." = "Save as PDF...";
"Export as HTML..." = "Export as HTML...";
"Copy as Rich Text" = "Copy as Rich Text";
"Export as RTF..." = "Export as RTF...";
"Export as Docx..." = "Export as Docx...";
"Live Preview" = "Live Preview";
"Upload Local Images to..." = "Upload Local Images to...";
"Setting Publish to Wordpress, Evernote..." = "Setting Publish to Wordpress, Evernote...";
"Delete the category?" = "Delete the category?";
"Deleted category cannot be restored." = "Deleted category cannot be restored.";
"Please select parent category !" = "Please select parent category !";

/* cfaexternalcontroller */
"Please select a floder !" = "Please select a floder !";
"A subfolder of %@ is already used as external source %@" = "A subfolder of \"%@\" is already used as external source \"%@\"";
"The folder %@ is already part of the external source %@" = "The folder \"%@\" is already part of the external source \"%@\"";
"Unable to add as external source." = "Unable to add as external source.";
"Remove the selected external source?" = "Remove the selected external source?";
"Delete the selected floder? The floder will move to trash!" = "Delete the selected floder? The floder will move to trash!";
"Remove" = "Remove";

/* appcontroller */
"Inbox" = "Inbox";
"Trash" = "Trash";
"Recent" = "Recent";

"EXTERNAL SOURCES" = "EXTERNAL SOURCES";
"Buy MWeb" = "Buy MWeb";

"checkLiteVersionLibraryIsMaxDescription" = "MWeb Lite's Documents Library is demo version of MWeb, If you like MWeb, Please buy MWeb for supporting MWeb's development. Thank you!";

"checkLiteVersionPublishIsMaxDescription" = "MWeb Lite's Publishing is demo version of MWeb. If you like MWeb, Please buy MWeb for supporting MWeb's development. Thank you!";

"checkLiteVersionExternalIsMaxDescription" = "MWeb Lite's External Source is demo version of MWeb. If you like MWeb, Please buy MWeb for supporting MWeb's development. Thank you!";

"checkLiteVersionLocalImagesUploadIsMaxDescription" = "MWeb Lite unsupport Local Images Upload Service. If you like MWeb, Please buy MWeb for supporting MWeb's development. Thank you!";

"checkLiteVersionGeneralDescription" = "MWeb Lite is demo version of MWeb. If you like MWeb, Please buy MWeb for supporting MWeb's development. Thank you!";

"Preferences" = "Preferences";

"Category_Orderby_Newest on Top" = "Newest on Top";
"Category_Orderby_Oldest on Top" = "Oldest on Top";
"Category_Orderby_Custom" = "Custom";
"Category_Orderby_Title" = "Title";

























